[
  {
	"tag": "0",
	"lines": [
  	"The game begins, player! Your mission: cultivate a robust plant",
	"witness the bloom of vibrant flowers, and gather the seeds",
	"to safeguard the plant kingdom's future."
	]
  },
  {
	"tag": "4",
	"lines": [
  	"Sunlight, crucial for plant growth, fuels photosynthesis,",
	"converting it into chemical energy through chlorophyll",
	"the green pigment defining plants. Without sunlight",
	"plants can't generate sufficient energy to thrive."
	]
  },
  {
	"tag": "5",
	"lines": [
  	"Plants require periods of darkness for their",
	"life cycle. Biochemical processes like respiration",
	"and hormone synthesis thrive mainly during the night",
	"crucial for complete plant growth."
	]
  },
  {
	"tag": "20",
	"lines": [
  	"Climate change poses a major threat to our planet's",
	"ecosystems. Rising temperatures and altered rainfall",
	"patterns disrupt plant and animal life globally.",
	"It's crucial to act now to safeguard our natural",
	"resources for a healthy future for all living things."
	]
  },
  {
	"tag": "11",
	"lines": [
  	"As you work to maximize the growth and seed production of your plant,",
  	"remember that every day counts, and that careful attention to",
  	"environmental factors and resource allocation can make all the",
  	"difference in the world."
	]
  },
  {
	"tag": "30",
	"lines": [
  	"Time is ticking, player! Make haste in nurturing those",
	"seeds. The level's conclusion is just around the corner."
	]
  },


  {
	"tag": "seed",
	"lines": [
  	"Rejoice, for a flower is now in your possession,",
	"a silent messenger of joy and beauty set to",
	"bloom under your care."
	]
  },
{
	"tag": "leaf",
	"lines": [
  	"Behold the leaf, your new companion in the",
	"dance of life, embracing sunlight to weave",
	"the magic of photosynthesis."
	]
  },
{
	"tag": "branch",
	"lines": [
  	"A branch, a symbol of expansion and upward",
	"mobility, now in your possession, set to create",
	"its own story in the ascending symphony of growth."
	]
  },
{
	"tag": "root",
	"lines": [
  	"Your latest acquisition: a root, a quiet explorer",
	"set to venture into the depths, unlocking",
	"the secrets hidden beneath the soil."
	]
  },
{
	"tag": "snail",
	"lines": [
  	"Ah, the persistent snails, dining on your plant's",
	"greenery! A reminder of nature's intricate balance."
	]
  },
  {
	"tag": "warning",
	"lines": [
  	"A fading plant, a visual cue for the player",
	"to intervene, recognizing the essence of",
	"energy as the driving force behind the",
	"flourishing dance of growth."
	]
  },
	{
	"tag": "water",
	"lines": [
  	"Thirsty plant alert! A gentle reminder",
	"to quench your flora's thirst.",
	"A well-hydrated plant is a resilient",
	"and thriving one."
	]
  },
	{
	"tag": "nutrient",
	"lines": [
  	"Time for a boost! Consider adding nutrients",
	"to the soil for an extra dose of vitality.",
	"Your plant will thank you with robust growth."
	]
  },
	{
	"tag": "bloom",
	"lines": [
  	"Flower in full bloom! A celebration of",
	"life and pollination. Watch for buzzing",
	"visitors like bees and butterflies,",
	"nature's pollination maestros."
	]
  }
]

